print('--- Калькулятор химического количества вещества ---')

a = int(input('Что нужно вычислить? (1 - химическое количество n, 2 - массу m): '))

if a == 1:
    m = float(input('Впишите массу m: '))
    M = int(input('Впишите молярную массу M: '))
    n = m / M

    print('Химическое количество вещества равно:', n, 'моль')

elif a == 2:
    n = float(input('Впишите химическое количество n: '))
    M = int(input('Впишите молярную массу M: '))
    m = n * M

    print('Масса вещества равна:', m, 'г')

else:
    print('Ошибка: неверный выбор режима данных.')
