print('--- Программа расчетного мониторинга газовых баллонов ---')

gas = int(input('Выберите газ. (1 - кислород O2, 2 - углекислый газ CO2, 3 - азот N2): '))
given = int(input('Что у Вас дано? (1 - масса m, 2 - Объём V): '))
value = float(input('Введите значение. Если m, то в граммах; если V, то в дм^3: '))

if gas != 1 and gas != 2 and gas != 3:
    print('Ошибка: неверный выбор режима данных.')
else:
    if gas == 1:
        name = 'Кислород'
        M = 32
    elif gas == 2:
        name = 'Углекислый газ'
        M = 44
    elif gas == 3:
        name = 'Азот'
        M = 28

    if given != 1 and given != 2:
        print('Ошибка: неверный выбор режима данных.')
    else:
        if given == 1:
            m = value
            n = m / M
            V = n * 22.4
        elif given == 2:
            V = value
            n = V / 22.4
            m = n * M
        
        print('Название газа: ', name, '\n', 'Химическое количество: ', n, ' моль', '\n', 'Масса: ', m, ' г', '\n', 'Объём: ', V, ' дм^3', sep='')

        if V > 100:
            print('ВНИМАНИЕ: Объем превышает критическую норму для одного баллона!')
        else:
            print('СТАТУС: Параметры газа в пределах нормы.')
